# Дан список чисел:
nums = [4, 7, 10, 15, 20, 23, 30]
# 1) С помощью цикла while пройти по списку.
# 2) Выводить только нечётные числа.
# 3) Если встретилось число 20 — цикл должен остановиться. исп. break
# 4) Все выведенные нечётные числа сохранить в множество odd_numbers.
###########
# Есть словарь товаров и цен:
products = {
    "apple": 100,
    "banana": 80,
    "orange": 120
}
# 1) В бесконечном цикле while запрашивать у пользователя название товара.
# 2) Если товар есть в словаре — вывести его цену.
# 3) Если товара нет — обработать ошибку через try / except и вывести сообщение "Такого товара нет".
# 4) Если пользователь ввёл stop — цикл должен завершиться.